; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty ?x - robot)
        (handfull ?x - robot)
        (holding ?x - block)
    )
    (:action pick-up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put-down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld2)
    (:domain blocksworld)
    (:objects
        green_block - block
        yellow_block - block
        pink_block - block
        purple_block - block
        orange_block - block
        red_block - block
        robot - robot
    )
    (:init
        (ontable green_block)
        (on yellow_block green_block)
        (on pink_block yellow_block)
        (on purple_block pink_block)
        (on orange_block purple_block)
        (on red_block orange_block)
        (handempty robot)
        (clear red_block)
    )
    (:goal (and 
        (on green_block yellow_block)
        (on yellow_block pink_block)
        (ontable pink_block)
        (on purple_block orange_block)
        (on orange_block red_block)
        (ontable red_block)
    ))
)

; plan
1. (unstack red_block orange_block robot)
   deleted: (clear red_block) (handempty robot) (on red_block orange_block)
   added: (holding red_block) (clear orange_block) (handfull robot)
   goals met: 0 of 6
2. (put-down red_block robot)
   deleted: (holding red_block) (handfull robot)
   added: (clear red_block) (handempty robot) (ontable red_block)
   goals met: 1 of 6
3. (unstack orange_block purple_block robot)
   deleted: (clear orange_block) (handempty robot) (on orange_block purple_block)
   added: (holding orange_block) (clear purple_block) (handfull robot)
   goals met: 1 of 6
4. (stack orange_block red_block robot)
   deleted: (holding orange_block) (clear red_block) (handfull robot)
   added: (clear orange_block) (handempty robot) (on orange_block red_block)
   goals met: 2 of 6
5. (unstack purple_block pink_block robot)
   deleted: (clear purple_block) (handempty robot) (on purple_block pink_block)
   added: (holding purple_block) (clear pink_block) (handfull robot)
   goals met: 2 of 6
6. (put-down purple_block robot)
   deleted: (holding purple_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (ontable purple_block)
   goals met: 2 of 6
7. (unstack pink_block yellow_block robot)
   deleted: (clear pink_block) (handempty robot) (on pink_block yellow_block)
   added: (holding pink_block) (clear yellow_block) (handfull robot)
   goals met: 2 of 6
8. (stack pink_block orange_block robot)
   deleted: (holding pink_block) (clear orange_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (on pink_block orange_block)
   goals met: 2 of 6
9. (unstack yellow_block green_block robot)
   deleted: (clear yellow_block) (handempty robot) (on yellow_block green_block)
   added: (holding yellow_block) (clear green_block) (handfull robot)
   goals met: 2 of 6
10. (put-down yellow_block robot)
   deleted: (holding yellow_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (ontable yellow_block)
   goals met: 2 of 6
11. (pick-up green_block robot)
   deleted: (ontable green_block) (clear green_block) (handempty robot)
   added: (handfull robot) (holding green_block)
   goals met: 2 of 6
12. (stack green_block yellow_block robot)
   deleted: (holding green_block) (clear yellow_block) (handfull robot)
   added: (clear green_block) (handempty robot) (on green_block yellow_block)
   goals met: 3 of 6
13. (unstack pink_block orange_block robot)
   deleted: (clear pink_block) (handempty robot) (on pink_block orange_block)
   added: (holding pink_block) (clear orange_block) (handfull robot)
   goals met: 3 of 6
14. (stack pink_block green_block robot)
   deleted: (holding pink_block) (clear green_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (on pink_block green_block)
   goals met: 3 of 6
15. (pick-up purple_block robot)
   deleted: (ontable purple_block) (clear purple_block) (handempty robot)
   added: (handfull robot) (holding purple_block)
   goals met: 3 of 6
16. (stack purple_block orange_block robot)
   deleted: (holding purple_block) (clear orange_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (on purple_block orange_block)
   goals met: 4 of 6
17. (unstack pink_block green_block robot)
   deleted: (clear pink_block) (handempty robot) (on pink_block green_block)
   added: (holding pink_block) (clear green_block) (handfull robot)
   goals met: 4 of 6
18. (put-down pink_block robot)
   deleted: (holding pink_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (ontable pink_block)
   goals met: 5 of 6
19. (unstack green_block yellow_block robot)
   deleted: (clear green_block) (handempty robot) (on green_block yellow_block)
   added: (holding green_block) (clear yellow_block) (handfull robot)
   goals met: 4 of 6
20. (stack green_block purple_block robot)
   deleted: (holding green_block) (clear purple_block) (handfull robot)
   added: (clear green_block) (handempty robot) (on green_block purple_block)
   goals met: 4 of 6
21. (pick-up yellow_block robot)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty robot)
   added: (handfull robot) (holding yellow_block)
   goals met: 4 of 6
22. (stack yellow_block pink_block robot)
   deleted: (holding yellow_block) (clear pink_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (on yellow_block pink_block)
   goals met: 5 of 6
23. (unstack green_block purple_block robot)
   deleted: (clear green_block) (handempty robot) (on green_block purple_block)
   added: (holding green_block) (clear purple_block) (handfull robot)
   goals met: 5 of 6
24. (stack green_block yellow_block robot)
   deleted: (holding green_block) (clear yellow_block) (handfull robot)
   added: (clear green_block) (handempty robot) (on green_block yellow_block)
   goals met: 6 of 6
